export enum fieldColorNames {
  red = 'rgb(255,0,0)',
  pink = 'rgb(255,192,203)',
  blue = 'rgb(135,206,235)',
  deepBlue = 'rgb(0,0,255)'
}


export const fieldColors = {
  [fieldColorNames.red]: [
    "А1",
    "А8",
    "А15",
    "З1",
    "З15",
    "О1",
    "О8",
    "О15"
  ],
  [fieldColorNames.pink]: [
    "Б2",
    "Б14",
    "В3",
    "В13",
    "Г4",
    "Г12",
    "Д5",
    "Д11",
    "З8",
    "К5",
    "К11",
    "Л4",
    "Л12",
    "М3",
    "М13",
    "Н2",
    "Н14"
  ],
  [fieldColorNames.blue]: [
    "А4",
    "А12",
    "В7",
    "В9",
    "Г1",
    "Г8",
    "Г15",
    "Ж3",
    "Ж7",
    "Ж9",
    "Ж13",
    "З4",
    "З12",
    "И3",
    "И7",
    "И9",
    "И13",
    "Л1",
    "Л8",
    "Л15",
    "М7",
    "М9",
    "О12",
    "О4"
  ],
  [fieldColorNames.deepBlue]: [
    "Б6",
    "Б10",
    "Е2",
    "Е6",
    "Е10",
    "Е14",
    "Й2",
    "Й6",
    "Й10",
    "Й14",
    "Н6",
    "Н10"
  ]
}
